// 포닉스는 길이가 N인 순열 A와 네 개의 비어 있는 스택을 가지고 있다.

import java.util.*;
import java.util.Stack;


public class Ponix25556 {
    public static void main(String[] args){

//        1. 정수 N을 입력 받아 길이가 N인 순열 A를 생성한다.
//       Scanner 객체 생성, int n에 입력값 저장, 순열 A는 길이가 N인 배열로 생성 (인덱스가 있어야 하고 중복 보장 불필요)

        Scanner sc = new Scanner(System.in);
        int n = sc.nextInt();
        sc.nextLine();

//        2. 그 다음 줄에 " "으로 구분된 일련의 정수를 입력 받아 순열 A에 저장한다. 입력되는 정수들은 각각 다른 수라는 것이 보장된다.

//
//        3. 네 개의 비어 있는 스택을 생성한다.
//
//        4. 순열 A의 원소들을 앞 원소부터 순서대로 네 개의 스택 중 하나에 삽입한다. (해당 스택에 마지막으로 저장된 값보다 큰 값이면 저장한다.)
//
//        5. 순열 A의 모든 원소가 스택에 삽입됐다면, 네 개 중 원하는 스택에서 수를 꺼낸다. (출력된 원소보다 1보다 작은 값이 있다면 꺼낸다. 없으면 작업을 종료하고 "NO"를 출력한다.
//
//        6. 모든 원소를 1씩 감소하는 순서로 꺼내서 출력할 수 있었다면 "YES"를 출력한다.

    }
}
